<a href="https://colab.research.google.com/github/bhargav23/AI/blob/master/Lab/Pandas_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Dataframes
## In this lecture
* Introduction to pandas
* Importing data
* Creating copy of original data
* Attributes of data
* Indexing and selecting data

In [0]:
import pandas as pd
import numpy as np

In [0]:
cars_data = pd.read_csv('https://raw.githubusercontent.com/bhargav23/Dataset/master/Toyota.csv',index_col=0)

In [3]:
cars_data

      Price   Age     KM FuelType  ... Automatic    CC  Doors  Weight
0     13500  23.0  46986   Diesel  ...         0  2000  three    1165
1     13750  23.0  72937   Diesel  ...         0  2000      3    1165
2     13950  24.0  41711   Diesel  ...         0  2000      3    1165
3     14950  26.0  48000   Diesel  ...         0  2000      3    1165
4     13750  30.0  38500   Diesel  ...         0  2000      3    1170
...     ...   ...    ...      ...  ...       ...   ...    ...     ...
1431   7500   NaN  20544   Petrol  ...         0  1300      3    1025
1432  10845  72.0     ??   Petrol  ...         0  1300      3    1015
1433   8500   NaN  17016   Petrol  ...         0  1300      3    1015
1434   7250  70.0     ??      NaN  ...         0  1300      3    1015
1435   6950  76.0      1   Petrol  ...         0  1600      5    1114

[1436 rows x 10 columns]

### Creating copy of original data
* In Python, there are two ways to create copies
  * Shallow copy
    * It only creates a new variable that shares the reference of the original object
    * Any changes made to a copy of object will be reflected in the original object as well
  * Deep copy
    * In case of deep copy, a copy of object is copied in other object with no reference to the original
    * Any changes made to a copy of object will not be reflected in the original object

**Shallow copy**

In [0]:
scpy = cars_data.copy(deep=False) 
#OR
scpy = cars_data

**Deep copy**

In [0]:
dcpy = cars_data.copy(deep=True)

### Attributes of data

* To get the **index** (row labels) of the dataframe

In [6]:
cars_data.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

* To get the **columns** of the dataframe

In [7]:
cars_data.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

* To get the total **number of elements** from the
dataframe

In [8]:
cars_data.size

14360

In [9]:
1436*10

14360

* To get the **dimensionality** of the dataframe

In [10]:
cars_data.shape

(1436, 10)

* The **memory usage** of each column in bytes

In [11]:
cars_data.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

* The number of axes / array dimensions

In [11]:
cars_data.ndim
#A two dimensional array stores data in a format consisting of rows and columns

2

### Indexing and selecting data 
* Python slicing operator '[ ]' and attribute/dot operator '.' are used for indexing
* Provides quick and easy access to pandas data structures

`DataFrame.head([n])`
* The function head() returns the first n rows from the dataframe
* By default, the head() returns first 5 rows

In [0]:
cars_data.head(20)

* The function tail() returns the last n rows for the object based on position

In [15]:
cars_data.tail()

      Price   Age     KM FuelType   HP  MetColor  Automatic    CC Doors  Weight
1431   7500   NaN  20544   Petrol   86       1.0          0  1300     3    1025
1432  10845  72.0     ??   Petrol   86       0.0          0  1300     3    1015
1433   8500   NaN  17016   Petrol   86       0.0          0  1300     3    1015
1434   7250  70.0     ??      NaN   86       1.0          0  1300     3    1015
1435   6950  76.0      1   Petrol  110       0.0          0  1600     5    1114

* To access a scalar value, the fastest way is to use the **at** and **iat** methods
* **at** provides label based scalar lookups

In [16]:
cars_data.head(8)

   Price   Age     KM FuelType    HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel    90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel    90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel    90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel    90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel    90       0.0          0  2000      3    1170
5  12950  32.0  61000   Diesel    90       0.0          0  2000      3    1170
6  16900  27.0     ??   Diesel  ????       NaN          0  2000      3    1245
7  18600  30.0  75889      NaN    90       1.0          0  2000      3    1245

In [15]:
cars_data.at[4,'FuelType']

'Diesel'

* **iat** provides integer based lookups

In [16]:
cars_data.iat[4,5]

0.0

### In this lecture
* Data types
	* Numeric
	* Character
* Checking data types of each column
* Count of unique data types
* Selecting data based on data types
* Concise summary of dataframe
* Checking format of each column
* Getting unique elements of each column

### Checking data types of each column
* **dtypes** returns a series with the data type of each column
* Syntax: **DataFrame.dtypes**

In [17]:
cars_data.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

### Selecting data based on data types
* **pandas.DataFrame.select_dtypes()** returns a subset of the columns from dataframe based on the column dtypes
* Syntax: **DataFrame.select_dtypes (include=None,exclude=None)**

In [18]:
cars_data.select_dtypes(exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [19]:
cars_data.select_dtypes(include=[int])

      Price  Automatic    CC  Weight
0     13500          0  2000    1165
1     13750          0  2000    1165
2     13950          0  2000    1165
3     14950          0  2000    1165
4     13750          0  2000    1170
...     ...        ...   ...     ...
1431   7500          0  1300    1025
1432  10845          0  1300    1015
1433   8500          0  1300    1015
1434   7250          0  1300    1015
1435   6950          0  1600    1114

[1436 rows x 4 columns]

In [20]:
cars_data.select_dtypes(include=[object])

         KM FuelType   HP  Doors
0     46986   Diesel   90  three
1     72937   Diesel   90      3
2     41711   Diesel   90      3
3     48000   Diesel   90      3
4     38500   Diesel   90      3
...     ...      ...  ...    ...
1431  20544   Petrol   86      3
1432     ??   Petrol   86      3
1433  17016   Petrol   86      3
1434     ??      NaN   86      3
1435      1   Petrol  110      5

[1436 rows x 4 columns]

### Concise summary of dataframe
* **info()** returns a concise summary of a dataframe
* data type of index
* data type of columns
* count of non null values
* memory usage
* Syntax: **DataFrame.info()**

In [21]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

### Checking format of each column
* By using **info()**, we can see
* **KM** has been read as object instead of integer
* **HP** has been read as object instead of integer
* **MetColor** and **Automatic** have been read as float64 and int64 respectively since it has values 0/1
* Ideally, **Doors** should’ve been read as int64 since it has values 2, 3, 4, 5. But it has been read as object
* Missing values present in few variables Let’s encounter the reason !

### Unique elements of columns
* unique() is used to find the unique elements of a column
* Syntax: **numpy.unique (array)**

Variable **KM**

In [22]:
np.unique(cars_data['KM'])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

* **KM** has special character to it - '??'
* Hence, it has been read as object instead of int64

Variable **HP**

In [23]:
np.unique(cars_data['HP'])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

* **HP** has special character to it - ????
* Hence, it has been read as object instead of int64

Variable **MetColor**

In [23]:
np.unique(cars_data['MetColor'])

array([ 0.,  1., nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan])

Variable **Automatic**

In [24]:
np.unique(cars_data['Automatic'])

array([0, 1])

Variable **Doors**

In [25]:
np.unique(cars_data['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

* **Doors** has been read as object instead of int64 because of
values ‘five’ ‘four’ ‘three’ which are strings

### Summary
* Data types
  * Numeric
  * Character
* Checked data types of each column
* Count of unique data types
* Selected data based on data types
* Concise summary of dataframe
* Checked format of each column
* Got unique elements of each column

### In this lecture
* Importing data
* Concise summary of dataframe
* Converting variable’s data types
* Category vs Object data type
* Cleaning column **Doors**
* Getting count of missing values

### Importing data
* We need to know how missing values are represented in the dataset in order to make reasonable decisions
* The missing values exist in the form of **nan**, **??**, **????**
  * Python, by default replace blank values with **nan**
* Now, importing the data considering other forms of missing values in a dataframe

* Summary before replacing special characters with nan (Observe KM & HP)

In [26]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

In [0]:
cars_data = pd.read_csv('https://raw.githubusercontent.com/bhargav23/Dataset/master/Toyota.csv',index_col=0,na_values=['??','????'])

* Summary after replacing special characters with nan (Observe KM & HP)

In [28]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

### Converting variable’s data types
* **astype** method is used to explicitly convert data types from one to another
* Syntax:**DataFrame.astype(dtype)**
* Converting **MetColor**   **Automatic** to object data type:

In [29]:
cars_data['MetColor'].astype(object)

0         1
1         1
2       NaN
3         0
4         0
       ...
1431      1
1432      0
1433      0
1434      1
1435      0
Name: MetColor, Length: 1436, dtype: object

In [30]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [0]:
cars_data['MetColor'] = cars_data['MetColor'].astype(object)

In [32]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB